
from random import randint
#1-10 ის ჩათვლით რენდომ რიცხვის იმპორტი ხდება ანუ ესაა ჩაფიქრებული ციფრი
a = (randint(1, 10))

print (a)
mcdeloba = 0   #ითვლის გამოსაცნობად განხორციელებული მცდელობების ოდენობას
while True:
    she_cifri = int(input("დაასახელეთ ციფრი :  ")) #ვასახელებთ ციფრს

    mcdeloba += 1
#თუ ჩაფიქრებული ციფრი მეტია უთითებს ამას
    if she_cifri > a:
        print ("დასახელებული ციფრი მეტია ჩაფიქრებულ ციფრზე")
#თუ ჩაფიქრებული ციფრი ნაკლებია უთითებს ამას
    if she_cifri < a:
       print ("დასახელებული ციფრი ნაკლებია ჩაფიქრებულ ციფრზე")

#თუ დამეთხვა ციფრი ბეჭდავს მოლოცვას და წყდება თამაში
    if a == she_cifri:
        print(f"გილოცავთ თქვენ გამოიცანით ჩაფიქრებული ციფრი! ციფრი შეარჩიეთ {mcdeloba} მცდელობით.")
        break

